{
    "nome": "Willian Nascimento Serrano",
    "titulo": "Analista de Sistemas Sênior",
    "contato": {
        "localizacao": "Itanhaém - SP",
        "telefone": "(13) 99791-8797",
        "email": "will.serrano.job@gmail.com"
    },
    "titulos": {
        "resumo": "Resumo Profissional",
        "experiencia": "Experiência Profissional",
        "competencias": "Competências Principais",
        "educacao": "Educação",
        "periodo": "Período",
        "tecnologia": "Tecnologias",
        "idiomas": "Idiomas"
    },
    "resumo": "Mais de 10 anos de experiência em desenvolvimento e sustentação de sistemas robustos, com expertise em tecnologias .NET, APIs REST, microsserviços e CI/CD. Além disso, possuo sólida experiência em bancos de dados relacionais e NoSQL, atuando em modelagem, otimização de queries e administração de sistemas de alto desempenho. Minhas atividades incluem a criação e manutenção de queries complexas, views, functions e stored procedures para análise de dados e operação de sistemas. Também sou proficiente no uso de ferramentas como SQL Server Profiler para monitoramento de performance e DTS da Microsoft para integração de dados. Tenho forte capacidade de análise de problemas e entrega de soluções otimizadas em ambientes corporativos.",
    "experiencias": [
        {
            "empresa": "Ambev",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2024 - Atual",
            "descricao": [
                "Desenvolvimento e sustentação do sistema MES Athena, responsável por gerenciar e monitorar processos produtivos.",
                "Atuação em middleware para integração e direcionamento de eventos operacionais entre microsserviços.",
                "Automatização de processos para melhorar a eficiência do time.",
                "Documentação técnica para facilitar a adaptação de novos desenvolvedores.",
                "Aplicação de padrões de qualidade e melhoria contínua do código.",
                "Aprimoramento em comunicação entre microsserviços no contexto MES.",
                "<b>Uso do SQL Server</b> para análise de dados e fluxo de informações entre microsserviços.",
                "<b>Implementação de Redis para cache</b> e ElasticSearch para armazenamento de dados transitórios e snapshots de modelos do negócio.",
                "<b>Análise do fluxo dos dados entre microsserviços</b> e interceptação de dados utilizando SQL Server Profiler.",
                "<b>Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization.</b>"
            ],
            "tecnologias": [
                "C#",
                ".Net Core",
                "EF Core",
                "Dapper",
                "DAO",
                "NUnit",
                "Mocking",
                "FluentAssertions",
                "Circuit Breaker",
                "APIs RESTful",
                "SQL Server",
                "SQL Server Profiler",
                "Migrations",
                "MassTransit",
                "Redis",
                "ElasticSearch",
                "Kibana",
                "MongoDB",
                "Serilog",
                "DataDog",
                "Kubernetes",
                "Docker Compose",
                "Rancher",
                "SonarQube",
                "Angular",
                "Domain-Driven Design (DDD)",
                "Design Patterns",
                "SOLID",
                "Clean Architecture",
                "Clean Code",
                "DRY",
                "Azure DevOps",
                "Azure Service Bus",
                "JWT",
                "Scrum",
                "Kanban",
                "Power Automate"
            ],
            "ambiente": "Ambiente colaborativo com altos padrões de qualidade e foco em sistemas MES."
        },
        {
            "empresa": "Gocil (Hive Group)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2023 - 2024",
            "descricao": [
                "Sustentação e desenvolvimento do SGO, sistema para gerenciamento de contratos de prestação de serviços.",
                "Manutenção e refatoração de processos críticos para correção de bugs e melhoria de performance.",
                "Implementação de funcionalidades no front-end e melhorias no layout.",
                "Gerenciamento do ciclo de vida completo do sistema, incluindo deploys e configuração de ambientes.",
                "Colaboração direta com analista de processos para alinhar requisitos técnicos e de negócio.",
                "<b>Manutenção e otimização de queries SQL</b> para análise de cenários e investigação de problemas em produção (PRD).",
                "<b>Geração de relatórios para BI</b> e melhorias em stored procedures.",
                "<b>Uso de EF Core, Dapper e DAO</b> para manipulação de dados.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization.</b>"
            ],
            "tecnologias": [
                "C#",
                ".Net Core",
                "EF",
                "EF Core",
                "Dapper",
                "DAO",
                "ADO.NET",
                "Design Patterns",
                "Domain-Driven Design (DDD)",
                "APIs RESTful",
                "SQL Server",
                "Migrations",
                "Angular",
                "GitLab CI/CD",
                "Jenkins",
                "Octopus"
            ],
            "ambiente": "Multidisciplinar e colaborativo, com foco em desenvolvimento, sustentação e práticas de DevOps."
        },
        {
            "empresa": "Tecsidel do Brasil",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2022 - 2024",
            "descricao": [
                "Desenvolvimento e sustentação de sistemas críticos para controle de tráfego e pedágios.",
                "Identificação e correção de bugs em sistemas de alta criticidade para garantir operações contínuas.",
                "Criação de relatórios customizáveis para controle de passagens, gerando receita adicional para a empresa.",
                "Desenvolvimento de microsserviço para transmissão de dados a órgãos externos, integrando sistemas e otimizando processos.",
                "<b>Trabalhou com SQL Server e Oracle</b>, dependendo do cliente (concessionárias).",
                "<b>Desenvolvimento de procedures para relatórios customizáveis</b>, permitindo a parametrização dinâmica dos resultados.",
                "<b>Todos os relatórios da empresa foram implementados utilizando SQL.</b>",
                "<b>Uso de DAO</b> para acesso a dados.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization.</b>"
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "APIs RESTful",
                "WCF",
                "Javascript",
                "AJAX",
                "Oracle",
                "SQL Server",
                "DAO",
                "ADO.NET",
                "Redmine",
                "Gitlab",
                "JAVA"
            ],
            "ambiente": "Totalmente remoto, com colaboração entre equipes nacionais e internacionais."
        },
        {
            "empresa": "BLK (MJV Technology & Innovation)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2021 - 2022",
            "descricao": [
                "Sustentação e evolução de sistemas financeiros para estratégias de investimento em ações.",
                "Manutenção e otimização do sistema Robotrader, garantindo estabilidade e desempenho.",
                "Migração do controle de acesso do Robotrader de VB6 para uma solução web moderna.",
                "Modelagem de banco de dados e desenvolvimento de scripts e queries para novos sistemas.",
                "Conversão de regras de negócio de sistemas legados para o novo ambiente.",
                "<b>Modelagem de banco de dados para controle de usuários</b> no sistema Robotrader, migrando de um sistema legado em VB6 para uma solução web.",
                "<b>Análise contínua dos dados</b> para identificação de falhas em estratégias de investimento.",
                "<b>Utilização de EF Core e Dapper</b> para acesso a dados.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization.</b>"
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "Angular",
                "Jest",
                "SQL Server",
                "EF Core",
                "Dapper",
                "FIX",
                "Jenkins",
                "Nexus",
                "SonarQube",
                "Windows Forms",
                "Event-Driven Architecture",
                "Scrum",
                "Confluence",
                "Bitbucket"
            ],
            "ambiente": "Time ágil, colaborativo e focado na evolução contínua dos sistemas."
        },
        {
            "empresa": "SKY Brasil (Third IT Solutions)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2018 - 2021",
            "descricao": [
                "Sustentação e desenvolvimento de sistemas comerciais, operacionais e financeiros, com foco em automação e eficiência.",
                "Automatização do pareamento de Decoders e SmartCards, reduzindo o tempo de processamento de lotes de 100 equipamentos de mais de 8 horas para 10 minutos.",
                "Automatização de validações entre sistemas de estoque, clientes e parceiros, acelerando redisponibilização de equipamentos.",
                "Monitoramento e sustentação de processos críticos diários, integrando dados de equipamentos e clientes ao sistema de comissionamento.",
                "Alinhamento com equipes financeiras e de DataCenter para garantir integração e confiabilidade dos processos.",
                "<b>Manutenção e otimização de queries, views, functions e procedures</b> para sistemas de campo e operacionais.",
                "<b>Desenvolvimento e suporte a processos de integração</b> utilizando DTS do SQL Server.",
                "<b>Melhorias em queries do ODI (Oracle Data Integrator)</b> para otimização do processo de comissionamento, garantindo envio de dados para o sistema Callidus na nuvem.",
                "<b>Uso de DAO</b> para interação com banco de dados.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization, Sharding, Particionamento, Materialized Views, Read Replicas.</b>"
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "APIs RESTful",
                "SOAP",
                "Console",
                "Angular",
                "Javascript",
                "Oracle",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "DTS",
                "ODI",
                "Power Automate",
                "Callidus",
                "Service-Oriented Architecture",
                "Splunk",
                "Automation Anywhere",
                "Power Automate",
                "JIRA"
            ],
            "ambiente": "Presencial e colaborativo com equipes multidisciplinares."
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Analista de Sistemas Pleno",
            "periodo": "2016 - 2018",
            "descricao": [
                "Sustentação do HexaVision, sistema de controle e análise de códigos-fonte, para o cliente Bradesco Alphaville.",
                "Melhorias de processos e automação de rotinas críticas.",
                "Desenvolvimento de aplicativo voltado à prestação de serviços para advogados facilitando a execução de tarefas administrativas em tribunais.",
                "<b>Manutenção em queries, procedures, functions e views</b> do sistema.",
                "<b>Modelagem de banco de dados</b> com criação e alteração de tabelas para novas funcionalidades.",
                "<b>Análise do fluxo dos dados entre sistemas</b> e interceptação utilizando SQL Server Profiler.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization.</b>",
                "<b>Uso de DAO e SQL Profiler</b> para manutenção e análise de desempenho."
            ],
            "tecnologias": [
                "ASP.Net",
                "VB.NET",
                "SQL Server",
                "SQL Server Profiler",
                "EF",
                "DAO",
                "ADO.NET",
                "JavaScript",
                "AJAX",
                "JQuery",
                "CSS",
                "Serviços Windows",
                "Serviços WCF",
                "Design Patterns",
                "Mensageria",
                "SVN",
                "Tortoise",
                "Vue.JS"
            ]
        },
        {
            "empresa": "TJSP - Tribunal de Justiça de São Paulo (MPS Informática)",
            "cargo": "Analista de Sistemas Pleno",
            "periodo": "2014 - 2016",
            "descricao": [
                "Sustentação e desenvolvimento de sistemas de Recursos Humanos.",
                "Sistemas: Frequência, Adicional de Qualificação e Plantão Judiciário.",
                "<b>Manutenção e otimização de views, functions e procedures</b> para sistemas de RH.",
                "<b>Modelagem de banco de dados e criação de tabelas</b> para novos módulos dos sistemas Adicional de Qualificação (AQ) e Plantão Judiciário.",
                "<b>Uso de DAO</b> para manipulação de dados.",
                "<b>Indexação, Normalização, Denormalização, Caching, Replicação, Análise de Locking e Concurrency Control, Query Optimization, Materialized Views, Read Replicas.</b>"
            ],
            "tecnologias": [
                "C#",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "ASP.Net",
                "MVC",
                "Serviços WCF",
                "Design Patterns",
                "Angular JS",
                "Tortoise",
                "TFS"
            ]
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Estagiário / Analista de Sistemas Júnior",
            "periodo": "2011 - 2014",
            "descricao": [
                "Sustentação de sistemas e suporte técnico em ambiente corporativo."
            ],
            "tecnologias": [
                "ASP.Net",
                "VB.NET",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "JavaScript",
                "AJAX",
                "JQuery",
                "CSS",
                "Serviços Windows",
                "Serviços WCF",
                "Design Patterns",
                "Mensageria",
                "SVN",
                "Tortoise"
            ]
        }
    ],
    "competencias": [
        "C#",
        ".NET Core",
        "Javascript",
        "SQL Server",
        "Oracle",
        "EF Core",
        "SOLID",
        "Clean Code",
        "Web Services",
        "Testes Unitários",
        "Design Patterns",
        "DTS",
        "MongoDB",
        "Conteinerização",
        "CI/CD"
    ],
    "educacao": [
        {
            "instituicao": "FATEC Praia Grande",
            "curso": "Análise e Desenvolvimento de Sistemas"
        },
        {
            "instituicao": "ETEC Aristóteles Ferreira",
            "curso": "Técnico em Eletroeletrônica"
        },
        {
            "instituicao": "ETEC Adolpho Berezin",
            "curso": "Técnico em Informática"
        }
    ],
    "idiomas": [
        {
            "idioma": "Inglês",
            "nivel": "Intermediário"
        },
        {
            "idioma": "Espanhol",
            "nivel": "Avançado"
        }
    ]
}