{
    "nome": "Willian Nascimento Serrano",
    "titulo": "Analista Senior de Sistemas",
    "contato": {
        "localizacao": "Itanhaém - SP",
        "disponibilidade": "Disponible para trabajo remoto",
        "email": "will.serrano.job@gmail.com"
    },
    "titulos": {
        "resumo": "Resumen Profesional",
        "experiencia": "Experiencia Profesional",
        "competencias": "Competencias Principales",
        "educacao": "Educación",
        "periodo": "Período",
        "tecnologia": "Tecnologías",
        "idiomas": "Idiomas"
    },
    "resumo": "Más de 10 años de experiencia en desarrollo y mantenimiento de sistemas, con enfoque en .NET, APIs REST, microservicios y CI/CD. Experiencia en integración de sistemas, modelado de bases de datos y optimización de procesos. Conocimientos en arquitectura de software, pruebas automatizadas y metodologías ágiles.",
    "experiencias": [
        {
            "empresa": "Ambev",
            "cargo": "Analista Senior de Sistemas",
            "periodo": "2024 - Actualidad",
            "descricao": [
                "Desarrollo y mantenimiento del sistema MES Athena, responsable de gestionar y monitorear procesos productivos.",
                "Desarrollo de middleware para integración y enrutamiento de eventos operativos entre microservicios.",
                "Automatización de procesos para mejorar la eficiencia del equipo.",
                "Documentación técnica para facilitar la integración de nuevos desarrolladores.",
                "Aplicación de estándares de calidad y mejora continua del código.",
                "Mejora de la comunicación entre microservicios en el contexto MES.",
                "<b>Uso de SQL Server</b> para análisis de datos y flujo de información entre microservicios.",
                "<b>Implementación de Redis para almacenamiento en caché</b> y ElasticSearch para almacenamiento de datos transitorios y snapshots de modelos de negocio.",
                "<b>Análisis del flujo de datos entre microservicios</b> e interceptación de datos utilizando SQL Server Profiler.",
                "<b>Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas.</b>"
            ],
            "tecnologias": [
                "C#",
                ".Net Core",
                "EF Core",
                "Dapper",
                "DAO",
                "NUnit",
                "Mocking",
                "FluentAssertions",
                "Circuit Breaker",
                "APIs RESTful",
                "SQL Server",
                "SQL Server Profiler",
                "Migrations",
                "MassTransit",
                "Redis",
                "ElasticSearch",
                "Kibana",
                "MongoDB",
                "Serilog",
                "DataDog",
                "Kubernetes",
                "Docker Compose",
                "Rancher",
                "SonarQube",
                "Angular",
                "Domain-Driven Design (DDD)",
                "Design Patterns",
                "SOLID",
                "Clean Architecture",
                "Clean Code",
                "DRY",
                "Azure DevOps",
                "Azure Service Bus",
                "JWT",
                "Scrum",
                "Kanban",
                "Power Automate"
            ],
            "ambiente": "Entorno colaborativo con altos estándares de calidad y enfoque en sistemas MES."
        },
        {
            "empresa": "Gocil (Hive Group)",
            "cargo": "Analista Senior de Sistemas",
            "periodo": "2023 - 2024",
            "descricao": [
                "Mantenimiento y desarrollo de SGO, sistema de gestión de contratos de prestación de servicios.",
                "Mantenimiento y refactorización de procesos críticos para corregir errores y mejorar el rendimiento.",
                "Implementación de funcionalidades en el front-end y mejoras en el diseño.",
                "Gestión del ciclo de vida completo del sistema, incluidos despliegues y configuración de entornos.",
                "Colaboración directa con analistas de procesos para alinear requisitos técnicos y de negocio.",
                "<b>Mantenimiento y optimización de consultas SQL</b> para el análisis de escenarios e investigación de problemas en producción (PRD).",
                "<b>Generación de informes para BI</b> y mejoras en procedimientos almacenados.",
                "<b>Uso de EF Core, Dapper y DAO</b> para la manipulación de datos.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas.</b>"
            ],
            "tecnologias": [
                "C#",
                ".Net Core",
                "EF",
                "EF Core",
                "Dapper",
                "DAO",
                "ADO.NET",
                "Design Patterns",
                "Domain-Driven Design (DDD)",
                "APIs RESTful",
                "SQL Server",
                "Migrations",
                "Angular",
                "GitLab CI/CD",
                "Jenkins",
                "Octopus"
            ],
            "ambiente": "Entorno multidisciplinario y colaborativo, enfocado en desarrollo, mantenimiento y prácticas de DevOps."
        },
        {
            "empresa": "Tecsidel do Brasil",
            "cargo": "Analista Senior de Sistemas",
            "periodo": "2022 - 2024",
            "descricao": [
                "Desarrollo y mantenimiento de sistemas críticos para el control de tráfico y peajes.",
                "Identificación y corrección de errores en sistemas de alta criticidad para garantizar operaciones continuas.",
                "Creación de informes personalizables para el control de pasajes, generando ingresos adicionales para la empresa.",
                "Desarrollo de un microservicio para la transmisión de datos a organismos externos, integrando sistemas y optimizando procesos.",
                "<b>Trabajó con SQL Server y Oracle</b>, dependiendo del cliente (concesionarias).",
                "<b>Desarrollo de procedimientos para informes personalizables</b>, permitiendo la parametrización dinámica de los resultados.",
                "<b>Todos los informes de la empresa fueron implementados utilizando SQL.</b>",
                "<b>Uso de DAO</b> para el acceso a datos.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas.</b>"
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "APIs RESTful",
                "WCF",
                "Javascript",
                "AJAX",
                "Oracle",
                "SQL Server",
                "DAO",
                "ADO.NET",
                "Redmine",
                "Gitlab",
                "JAVA"
            ],
            "ambiente": "Completamente remoto, con colaboración entre equipos nacionales e internacionales."
        },
        {
            "empresa": "BLK (MJV Technology & Innovation)",
            "cargo": "Analista Senior de Sistemas",
            "periodo": "2021 - 2022",
            "descricao": [
                "Mantenimiento y evolución de sistemas financieros para estrategias de inversión en acciones.",
                "Mantenimiento y optimización del sistema Robotrader, garantizando estabilidad y rendimiento.",
                "Migración del control de acceso del Robotrader de VB6 a una solución web moderna.",
                "Modelado de bases de datos y desarrollo de scripts y consultas para nuevos sistemas.",
                "Conversión de reglas de negocio de sistemas heredados al nuevo entorno.",
                "<b>Modelado de base de datos para control de usuarios</b> en el sistema Robotrader, migrando desde un sistema heredado en VB6 a una solución web.",
                "<b>Análisis continuo de datos</b> para identificar fallos en estrategias de inversión.",
                "<b>Utilización de EF Core y Dapper</b> para acceso a datos.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas.</b>"
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "Angular",
                "Jest",
                "SQL Server",
                "EF Core",
                "Dapper",
                "FIX",
                "Jenkins",
                "Nexus",
                "SonarQube",
                "Windows Forms",
                "Event-Driven Architecture",
                "Scrum",
                "Confluence",
                "Bitbucket"
            ],
            "ambiente": "Equipo ágil, colaborativo y enfocado en la evolución continua de los sistemas."
        },
        {
            "empresa": "SKY Brasil (Third IT Solutions)",
            "cargo": "Analista Senior de Sistemas",
            "periodo": "2018 - 2021",
            "descricao": [
                "Mantenimiento y desarrollo de sistemas comerciales, operativos y financieros, enfocados en automatización y eficiencia.",
                "Automatización de la vinculación de Decoders y SmartCards, reduciendo el tiempo de procesamiento de lotes de 100 equipos de más de 8 horas a 10 minutos.",
                "Automatización de validaciones entre sistemas de inventario, clientes y socios, acelerando la redistribución de equipos.",
                "Monitoreo y mantenimiento de procesos críticos diarios, integrando datos de equipos y clientes al sistema de comisiones.",
                "Alineación con equipos financieros y de DataCenter para garantizar integración y confiabilidad de los procesos.",
                "<b>Mantenimiento y optimización de consultas, vistas, funciones y procedimientos</b> para sistemas de campo y operacionales.",
                "<b>Desarrollo y soporte a procesos de integración</b> utilizando DTS de SQL Server.",
                "<b>Mejoras en consultas de ODI (Oracle Data Integrator)</b> para optimizar el proceso de comisionamiento, garantizando el envío de datos al sistema Callidus en la nube.",
                "<b>Uso de DAO</b> para interacción con bases de datos.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas, Sharding, Particionamiento, Vistas Materializadas, Read Replicas.</b>"
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "APIs RESTful",
                "SOAP",
                "Console",
                "Angular",
                "Javascript",
                "Oracle",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "DTS",
                "ODI",
                "Power Automate",
                "Callidus",
                "Service-Oriented Architecture",
                "Splunk",
                "Automation Anywhere",
                "Power Automate",
                "JIRA"
            ],
            "ambiente": "Presencial y colaborativo con equipos multidisciplinarios."
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Analista de Sistemas Semi-Senior",
            "periodo": "2016 - 2018",
            "descricao": [
                "Mantenimiento de HexaVision, sistema de control y análisis de código fuente, para el cliente Bradesco Alphaville.",
                "Mejoras de procesos y automatización de rutinas críticas.",
                "Desarrollo de una aplicación dirigida a la prestación de servicios para abogados, facilitando la ejecución de tareas administrativas en tribunales.",
                "<b>Mantenimiento de consultas, procedimientos, funciones y vistas</b> del sistema.",
                "<b>Modelado de bases de datos</b> con creación y modificación de tablas para nuevas funcionalidades.",
                "<b>Análisis del flujo de datos entre sistemas</b> e interceptación utilizando SQL Server Profiler.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas.</b>",
                "<b>Uso de DAO y SQL Profiler</b> para mantenimiento y análisis de rendimiento."
            ],
            "tecnologias": [
                "ASP.Net",
                "VB.NET",
                "SQL Server",
                "SQL Server Profiler",
                "EF",
                "DAO",
                "ADO.NET",
                "JavaScript",
                "AJAX",
                "JQuery",
                "CSS",
                "Serviços Windows",
                "Serviços WCF",
                "Design Patterns",
                "Mensageria",
                "SVN",
                "Tortoise",
                "Vue.JS"
            ]
        },
        {
            "empresa": "TJSP - Tribunal de Justiça de São Paulo (MPS Informática)",
            "cargo": "Analista de Sistemas Semi-Senior",
            "periodo": "2014 - 2016",
            "descricao": [
                "Mantenimiento y desarrollo de sistemas de Recursos Humanos.",
                "Sistemas: Frecuencia, Adicional por Calificación y Guardia Judicial.",
                "<b>Mantenimiento y optimización de vistas, funciones y procedimientos</b> para sistemas de RRHH.",
                "<b>Modelado de bases de datos y creación de tablas</b> para nuevos módulos de los sistemas Adicional de Calificación (AQ) y Plantón Judicial.",
                "<b>Uso de DAO</b> para manipulación de datos.",
                "<b>Indexación, Normalización, Desnormalización, Caching, Replicación, Análisis de bloqueo y control de concurrencia, Optimización de consultas, Vistas Materializadas, Read Replicas.</b>"
            ],
            "tecnologias": [
                "C#",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "ASP.Net",
                "MVC",
                "Serviços WCF",
                "Design Patterns",
                "Angular JS",
                "Tortoise",
                "TFS"
            ]
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Pasante / Analista Junior de Sistemas",
            "periodo": "2011 - 2014",
            "descricao": [
                "Mantenimiento de sistemas y soporte técnico en entornos corporativos."
            ],
            "tecnologias": [
                "ASP.Net",
                "VB.NET",
                "SQL Server",
                "EF",
                "DAO",
                "ADO.NET",
                "JavaScript",
                "AJAX",
                "JQuery",
                "CSS",
                "Serviços Windows",
                "Serviços WCF",
                "Design Patterns",
                "Bróker de Mensajería",
                "SVN",
                "Tortoise"
            ]
        }
    ],
    "competencias": [
        "C#",
        ".NET Core",
        "Javascript",
        "SQL Server",
        "Oracle",
        "EF Core",
        "SOLID",
        "Clean Code",
        "Web Services",
        "Testes Unitários",
        "Design Patterns",
        "DTS",
        "MongoDB",
        "Conteinerização",
        "CI/CD"
    ],
    "educacao": [
        {
            "instituicao": "FATEC Praia Grande",
            "curso": "Análisis y Desarrollo de Sistemas"
        },
        {
            "instituicao": "ETEC Aristóteles Ferreira",
            "curso": "Técnico en Electrónica"
        },
        {
            "instituicao": "ETEC Adolpho Berezin",
            "curso": "Técnico en Informática"
        }
    ],
    "idiomas": [
        {
            "idioma": "Portugués",
            "nivel": "Nativo"
        },
        {
            "idioma": "Inglés",
            "nivel": "Intermedio"
        },
        {
            "idioma": "Español",
            "nivel": "Avanzado"
        }
    ]
}