{
    "nome": "Willian Nascimento Serrano",
    "titulo": "Senior Systems Analyst",
    "contato": {
        "localizacao": "Itanhaém - SP",
        "telefone": "(13) 99791-8797",
        "email": "will.serrano.job@gmail.com"
    },
    "titulos": {
        "resumo": "Professional Summary",
        "experiencia": "Professional Experience",
        "competencias": "Key Skills",
        "educacao": "Education"
    },
    "resumo": "Over 10 years of experience in developing robust systems, with expertise in .NET technologies, REST APIs, microservices, and CI/CD. Proficient in problem analysis and delivering optimized solutions in corporate environments.",
    "experiencias": [
        {
            "empresa": "Ambev",
            "cargo": "Senior Systems Analyst",
            "periodo": "2024 - Present",
            "descricao": [
                "Development and maintenance of the MES Athena system, responsible for managing and monitoring production processes.",
                "Middleware development for integration and routing of operational events between microservices.",
                "Process automation to improve team efficiency.",
                "Technical documentation to facilitate the onboarding of new developers.",
                "Applying quality standards and continuous code improvement.",
                "Enhancing communication between microservices within the MES context."
            ],
            "tecnologias": [
                "C#",
                "REST API",
                "Azure Service Bus",
                "Migrations",
                "DataDog",
                "SOLID",
                "Clean Architecture",
                "Clean Code",
                "DRY"
            ],
            "ambiente": "Collaborative environment with high-quality standards and a focus on MES systems."
        },
        {
            "empresa": "Gocil (Hive Group)",
            "cargo": "Senior Systems Analyst",
            "periodo": "2023 - 2024",
            "descricao": [
                "Maintenance and development of SGO, a service contract management system.",
                "Critical process maintenance and refactoring to fix bugs and improve performance.",
                "Implementation of front-end features and layout improvements.",
                "Full lifecycle management of the system, including deployments and environment configuration.",
                "Direct collaboration with process analysts to align technical and business requirements."
            ],
            "tecnologias": [
                "C#",
                "Entity Framework",
                "Dapper",
                "SQL Server",
                "Angular",
                "Jenkins",
                "Octopus"
            ],
            "ambiente": "Multidisciplinary and collaborative environment focused on development, support, and DevOps practices."
        },
        {
            "empresa": "Tecsidel do Brasil",
            "cargo": "Senior Systems Analyst",
            "periodo": "2022 - 2024",
            "descricao": [
                "Development and maintenance of critical systems for traffic and toll control.",
                "Bug identification and fixes in high-criticality systems to ensure continuous operations.",
                "Creation of customizable reports for passage control, generating additional revenue for the company.",
                "Development of a microservice for data transmission to external agencies, integrating systems and optimizing processes."
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "MVC",
                "API",
                "WCF",
                "Services",
                "Console",
                "Javascript",
                "AJAX",
                "Oracle",
                "SQL Server"
            ],
            "ambiente": "Fully remote, with collaboration among national and international teams."
        },
        {
            "empresa": "BLK (MJV Technology & Innovation)",
            "cargo": "Senior Systems Analyst",
            "periodo": "2021 - 2022",
            "descricao": [
                "Maintenance and evolution of financial systems for stock investment strategies.",
                "Maintenance and optimization of the Robotrader system, ensuring stability and performance.",
                "Migration of Robotrader access control from VB6 to a modern web solution.",
                "Database modeling and development of scripts and queries for new systems.",
                "Converting business rules from legacy systems to the new environment."
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "Angular",
                "SQL Server",
                "FIX",
                "Jenkins",
                "Nexus"
            ],
            "ambiente": "Agile, collaborative team focused on continuous system evolution."
        },
        {
            "empresa": "SKY Brasil (Third IT Solutions)",
            "cargo": "Senior Systems Analyst",
            "periodo": "2018 - 2021",
            "descricao": [
                "Maintenance and development of commercial, operational, and financial systems, focusing on automation and efficiency.",
                "Automation of Decoder and SmartCard pairing, reducing batch processing time for 100 devices from over 8 hours to 10 minutes.",
                "Automation of validations between inventory, customer, and partner systems, speeding up equipment redistributions.",
                "Monitoring and maintenance of critical daily processes, integrating equipment and customer data into the commission system.",
                "Alignment with financial and DataCenter teams to ensure integration and process reliability."
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "API",
                "WCF",
                "Services",
                "Console",
                "Javascript",
                "Oracle",
                "SQL Server",
                "DTS",
                "ODI",
                "Power Automate"
            ],
            "ambiente": "On-site and collaborative with multidisciplinary teams."
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Mid-Level Systems Analyst",
            "periodo": "2016 - 2018",
            "descricao": [
                "Maintenance of HexaVision, a source code control and analysis system for Bradesco Alphaville.",
                "Process improvements and automation of critical routines.",
                "Development of an application aimed at facilitating administrative tasks in courts for lawyers."
            ],
            "tecnologias": ["C#", "SQL Server", "ASP.NET"]
        },
        {
            "empresa": "TJSP - Tribunal de Justiça de São Paulo (MPS Informática)",
            "cargo": "Mid-Level Systems Analyst",
            "periodo": "2014 - 2016",
            "descricao": [
                "Maintenance and development of Human Resources systems.",
                "Systems: Frequency, Qualification Bonus, and Judicial Duty."
            ],
            "tecnologias": ["C#", "SQL Server"]
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Intern / Junior Systems Analyst",
            "periodo": "2011 - 2014",
            "descricao": [
                "System maintenance and technical support in a corporate environment."
            ],
            "tecnologias": ["VB.NET", "SQL Server"]
        }
    ],
    "competencias": [
        "C#", ".NET Core", "RESTful API", "SQL Server", "Angular", 
        "ASP.NET", "Design Patterns", "SOLID Principles", "WCF", 
        "DTS", "ODI", "Jenkins", "Power Automate"
    ],
    "educacao": [
        {
            "instituicao": "FATEC Praia Grande",
            "curso": "Systems Analysis and Development"
        },
        {
            "instituicao": "ETEC Aristóteles Ferreira",
            "curso": "Electronics Technician"
        },
        {
            "instituicao": "ETEC Adolpho Berezin",
            "curso": "Computer Technician"
        }
    ],
    "idiomas": {
        "espanhol": "Advanced",
        "ingles": "Intermediate"
    }
}
