{
    "nome": "Willian Nascimento Serrano",
    "titulo": "Analista de Sistemas Sênior",
    "contato": {
        "localizacao": "Itanhaém - SP",
        "telefone": "(13) 99791-8797",
        "email": "will.serrano.job@gmail.com"
    },
    "titulos": {
        "resumo": "Resumo Profissional",
        "experiencia": "Experiência Profissional",
        "competencias": "Competências Principais",
        "educacao": "Educação",
        "periodo": "Período",
        "tecnologia": "Tecnologias",
        "idiomas": "Idiomas"
    },
    "resumo": "Mais de 10 anos de experiência no <b>desenvolvimento</b> e <b>sustentação</b> de sistemas robustos, com expertise em tecnologias .NET, APIs REST, microsserviços e CI/CD. Proficiente em análise de problemas e entrega de soluções otimizadas em ambientes corporativos.",
    "experiencias": [
        {
            "empresa": "Ambev",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2024 - Atual",
            "descricao": [
                "Desenvolvimento e sustentação do sistema MES Athena, responsável por gerenciar e monitorar processos produtivos.",
                "Atuação em middleware para integração e direcionamento de eventos operacionais entre microsserviços.",
                "Automatização de processos para melhorar a eficiência do time.",
                "Documentação técnica para facilitar a adaptação de novos desenvolvedores.",
                "Aplicação de padrões de qualidade e melhoria contínua do código.",
                "Aprimoramento em comunicação entre microsserviços no contexto MES."
            ],
            "tecnologias": [
                "C#",
                "REST API",
                "Azure Service Bus",
                "Migrations",
                "DataDog",
                "SOLID",
                "Clean Architecture",
                "Clean Code",
                "DRY"
            ],
            "ambiente": "Ambiente colaborativo com altos padrões de qualidade e foco em sistemas MES."
        }
        ,        
        {
            "empresa": "Gocil (Hive Group)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2023 - 2024",
            "descricao": [
                "Sustentação e desenvolvimento do SGO, sistema para gerenciamento de contratos de prestação de serviços.",
                "Manutenção e refatoração de processos críticos para correção de bugs e melhoria de performance.",
                "Implementação de funcionalidades no front-end e melhorias no layout.",
                "Gerenciamento do ciclo de vida completo do sistema, incluindo deploys e configuração de ambientes.",
                "Colaboração direta com analista de processos para alinhar requisitos técnicos e de negócio."
            ],
            "tecnologias": [
                "C#",
                "Entity Framework",
                "Dapper",
                "SQL Server",
                "Angular",
                "Jenkins",
                "Octopus"
            ],
            "ambiente": "Multidisciplinar e colaborativo, com foco em desenvolvimento, sustentação e práticas de DevOps."
        }
        ,        
        {
            "empresa": "Tecsidel do Brasil",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2022 - 2024",
            "descricao": [
                "Desenvolvimento e sustentação de sistemas críticos para controle de tráfego e pedágios.",
                "Identificação e correção de bugs em sistemas de alta criticidade para garantir operações contínuas.",
                "Criação de relatórios customizáveis para controle de passagens, gerando receita adicional para a empresa.",
                "Desenvolvimento de microsserviço para transmissão de dados a órgãos externos, integrando sistemas e otimizando processos."
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "MVC",
                "API",
                "WCF",
                "Services",
                "Console",
                "Javascript",
                "AJAX",
                "Oracle",
                "SQL Server"
            ],
            "ambiente": "Totalmente remoto, com colaboração entre equipes nacionais e internacionais."
        }
        ,
        {
            "empresa": "BLK (MJV Technology & Innovation)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2021 - 2022",
            "descricao": [
                "Sustentação e evolução de sistemas financeiros para estratégias de investimento em ações.",
                "Manutenção e otimização do sistema Robotrader, garantindo estabilidade e desempenho.",
                "Migração do controle de acesso do Robotrader de VB6 para uma solução web moderna.",
                "Modelagem de banco de dados e desenvolvimento de scripts e queries para novos sistemas.",
                "Conversão de regras de negócio de sistemas legados para o novo ambiente."
            ],
            "tecnologias": [
                ".Net Core",
                "C#",
                "ASP.Net",
                "Angular",
                "SQL Server",
                "FIX",
                "Jenkins",
                "Nexus"
            ],
            "ambiente": "Time ágil, colaborativo e focado na evolução contínua dos sistemas."
        }
        ,
        {
            "empresa": "SKY Brasil (Third IT Solutions)",
            "cargo": "Analista de Sistemas Sênior",
            "periodo": "2018 - 2021",
            "descricao": [
                "Sustentação e desenvolvimento de sistemas comerciais, operacionais e financeiros, com foco em automação e eficiência.",
                "Automatização do pareamento de Decoders e SmartCards, reduzindo o tempo de processamento de lotes de 100 equipamentos de mais de 8 horas para 10 minutos.",
                "Automatização de validações entre sistemas de estoque, clientes e parceiros, acelerando redisponibilização de equipamentos.",
                "Monitoramento e sustentação de processos críticos diários, integrando dados de equipamentos e clientes ao sistema de comissionamento.",
                "Alinhamento com equipes financeiras e de DataCenter para garantir integração e confiabilidade dos processos."
            ],
            "tecnologias": [
                "C#",
                "ASP.Net",
                "MVC",
                "API",
                "WCF",
                "Services",
                "Console",
                "Javascript",
                "Oracle",
                "SQL Server",
                "DTS",
                "ODI",
                "Power Automate"
            ],
            "ambiente": "Presencial e colaborativo com equipes multidisciplinares."
        }        
        ,
        {
            "empresa": "Hexa Solution",
            "cargo": "Analista de Sistemas Pleno",
            "periodo": "2016 - 2018",
            "descricao": [
                "Sustentação do HexaVision, sistema de controle e análise de códigos-fonte, para o cliente Bradesco Alphaville.",
                "Melhorias de processos e automação de rotinas críticas.",
                "Desenvolvimento de aplicativo voltado à prestação de serviços para advogados facilitando a execução de tarefas administrativas em tribunais."
            ],
            "tecnologias": ["C#", "SQL Server", "ASP.NET"]
        },
        {
            "empresa": "TJSP - Tribunal de Justiça de São Paulo (MPS Informática)",
            "cargo": "Analista de Sistemas Pleno",
            "periodo": "2014 - 2016",
            "descricao": [
                "Sustentação e desenvolvimento de sistemas de Recursos Humanos.",
                "Sistemas: Frequência, Adicional de Qualificação e Plantão Judiciário."
            ],
            "tecnologias": ["C#", "SQL Server"]
        },
        {
            "empresa": "Hexa Solution",
            "cargo": "Estagiário / Analista de Sistemas Júnior",
            "periodo": "2011 - 2014",
            "descricao": [
                "Sustentação de sistemas e suporte técnico em ambiente corporativo."
            ],
            "tecnologias": ["VB.NET", "SQL Server"]
        }
    ],
    "competencias": [
        "C# e .NET Core", "Javascript e Typescript", "Entity Framework e Dapper", "SOLID e Design Patterns", "TDD e Clean Code", "APIs RESTful e Swagger/OpenAPI", "Testes Unitários com xUnit/NUnit e Mocking",
        "SQL Server e MongoDB", "Docker e Kubernetes", "Jenkins e Octopus", "Nexus e SonarQube"
    ],
    "educacao": [
        {
            "instituicao": "FATEC Praia Grande",
            "curso": "Análise e Desenvolvimento de Sistemas"
        },
        {
            "instituicao": "ETEC Aristóteles Ferreira",
            "curso": "Técnico em Eletroeletrônica"
        },
        {
            "instituicao": "ETEC Adolpho Berezin",
            "curso": "Técnico em Informática"
        }
    ],
    "idiomas": [
        {
            "idioma": "Inglês", 
            "nivel": "Intermediário"
        },
        {
            "idioma": "Espanhol", 
            "nivel": "Avançado"
        }
    ]
}
